
// Создали пустой массив

var names = [];


// Создали цикл, цикл запущили в массив, при помощи console.log смотрим результат

создать цикл

names.push(цикл);



console.log('names', names);


// Выводим форму для ввода имени, информацию с формы пушим в массив, при помощи console.log смотрим результат добавления дополнительного имени


addName = prompt('Enter additional name');

names.push(addName);

console.log('names', names);


// Создаем функцию для сравнения этого имени с массивом. С условием: нет совпадения - выдавать с помощью alert сообщение об ошибке, если есть выводить сообщение "Имя пользователя, вы успешно вошли"

